In [1]:
import pandas as pd

friend_dict_list = [
    {'name': 'Jone', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 30, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]

df = pd.DataFrame(friend_dict_list, columns=['name', 'age', 'job'])

In [2]:
df.head()

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [3]:
df['salary'] = 0

In [4]:
df.head()

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [5]:
import numpy as np

In [6]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [7]:
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [8]:
friend_dict_list = [
    {'name': 'Jone', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 30, 'final': 10}
]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

In [9]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [10]:
df['total'] = df['midterm'] + df['final']

In [11]:
df.head()

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [12]:
df['average'] = df['total'] / 2

In [13]:
df.head()

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [14]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')
        
df['grade'] = grades

In [15]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [16]:
def pass_or_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [17]:
df.grade = df.grade.apply(pass_or_fail)

In [18]:
df.head()

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [19]:
date_list = [
    {
        'yyyy-mm-dd': '2006-06-27'
    },
    {
        'yyyy-mm-dd': '2007-10-27'
    }
]

df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])

In [20]:
df.head()

   yyyy-mm-dd
0  2006-06-27
1  2007-10-27

In [21]:
def extract_year(now):
    return now.split('-')[0]

In [22]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [23]:
df

   yyyy-mm-dd  year
0  2006-06-27  2006
1  2007-10-27  2007

In [24]:
friend_dict_list = [
    {'name': 'Jone', 'midterm': 95, 'final': 85},
    {'name': 'Jenny', 'midterm': 85, 'final': 80},
    {'name': 'Nate', 'midterm': 30, 'final': 10}
]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

In [25]:
df.head()

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [26]:
df2 = pd.DataFrame([
    ['Ben', 50, 50]
], columns=['name', 'midterm', 'final'])

In [27]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [28]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50